src/InformationRegisters/дкл_ПользователиСкладов/дкл_ПользователиСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_ПользователиСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаСтатуса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроверятьАвторизациюНаАСХ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>EnumRef.дкл_РолиПользователей</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>УправлениеЧерез1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>active_</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>login</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>middleName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>password</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>position</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remotePassword</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>remoteLogin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>rfid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>role</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>userId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/дкл_Обработки/дкл_Обработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_Обработки</name>
  <resources>
    <name>ИмяОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отладка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогОтладки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВнутренняяОбработка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>НастройкаВебСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаВебСервисаДляКопии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.дкл_ТипыСообщений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Направление</name>
    <type>
      <types>EnumRef.дкл_НаправлениеСообщения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_ТипыСообщений/дкл_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_ТипыСообщений</name>
  <enumValues>
    <name>changeOrderStatus</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v16</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v21</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v21_HTTP</name>
  </enumValues>
  <enumValues>
    <name>ExternalIntegration_v25</name>
  </enumValues>
  <enumValues>
    <name>submitOrder</name>
  </enumValues>
  <enumValues>
    <name>submitRetrievalOrders</name>
  </enumValues>
  <enumValues>
    <name>submitStorageOrders</name>
  </enumValues>
  <enumValues>
    <name>uploadItemList</name>
  </enumValues>
  <enumValues>
    <name>uploadUserList</name>
  </enumValues>
</mdclass:Enum>

src/Enums/дкл_НаправлениеСообщения/дкл_НаправлениеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_НаправлениеСообщения</name>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/дкл_НастройкиСкладовЛифтов/дкл_НастройкиСкладовЛифтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>дкл_НастройкиСкладовЛифтов</name>
  <attributes>
    <name>machineId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтодобавлениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтопереводОрдеровВСтатусReady</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМеханики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАСХ</name>
    <type>
      <types>EnumRef.дкл_ВидыАСХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоположениеWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоУстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОповещений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.дкл_СпособПодключения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиОповещений</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПолки</name>
    <attributes>
      <name>trayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>width</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>depth</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>barcode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ярус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/дкл_ОбменДаннымиСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает версию ПО АСХ 
//
// Параметры:
// НастройкаСклада - СправочникСсылка.дкл_НастройкаСклада - настройка склада, для которой надо определить версию ПО
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица замены.
//
Функция ВерсияПО(НастройкаСклада) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	//@skip-check wrong-string-literal-content
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСклада, "ВерсияПО");

КонецФункции

#Область ОбщиеДляВерсийПОФункции

// Получает состояние склада-лифта запросом через веб-сервис
//
// Параметры:
// НастройкаСклада - СправочникСсылка.дкл_НастройкаСклада - настройка склада, для которой надо определить версию ПО
//
// Возвращаемое значение:
//  Состояние - Структура - структура со свойствами состояния
//                                                           
Функция ПолучитьСостояниеСкладаЛифта(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Интерфейс = "DVSStatusService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);
	
	//@skip-check bsl-variable-name-invalid
	params = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetDVSStatus"));	       

	Ответ = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "DVSStatusResult"));	       
		
	Ответ = 
	Прокси.getDVSStatus(params);
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ОбъектXDTOВСтруктуру(Ответ);

КонецФункции

// Получает список полок склада-лифта запросом через веб-сервис
//
// Параметры:
// НастройкаСклада - СправочникСсылка.дкл_НастройкаСклада - настройка склада, для которой надо определить версию ПО
//
// Возвращаемое значение:
//  Список полок - структура с перечем полок
//                                                           
Функция ПолучитьСписокПолокСкладаЛифта(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ПолучитьСписокПолокСкладаЛифта(НастройкаСклада);

КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСписокМестХраненияСкладаЛифта(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Интерфейс = "StorageService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);
	
	Если мФабрикаXDTO = Неопределено Тогда
		Возврат Новый Структура; 	
	КонецЕсли;
	
	//@skip-check bsl-variable-name-invalid
	request = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetStorageList"));	       
	
	Ответ = Прокси.getStorageList(request);
	
	Возврат ОбъектXDTOВСтруктуру(Ответ);

КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСтатусыПолокСкладаЛифта(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Интерфейс = "TrayService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);    
	
	Если мФабрикаXDTO = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	GetTrayStatus = мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetTrayStatus");
	
	Если НЕ GetTrayStatus = Неопределено Тогда
		//@skip-check bsl-variable-name-invalid
		request = мФабрикаXDTO.Создать(GetTrayStatus);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Ответ = Прокси.getTrayStatus(request);
	Исключение                                      
		ОбщегоНазначения.СообщитьПользователю(
			ОбработкаОшибок.КраткоеПредставлениеОшибки((ИнформацияОбОшибке())));	
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ОбъектXDTOВСтруктуру(Ответ);

КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура ВыгрузитьНоменклатуруСклада(НастройкаСклада) Экспорт   
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Обработка.ВыгрузитьНоменклатуруСклада(НастройкаСклада);
	
КонецПроцедуры

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура ВыгрузитьПользователейСклада(НастройкаСклада, Знач МассивПользователей = Неопределено, Знач МассивUserId = Неопределено) Экспорт

	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ МассивПользователей = Неопределено И НЕ ТипЗнч(МассивПользователей) = Тип("Массив") Тогда
		Пользователь = МассивПользователей;
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(Пользователь);
	КонецЕсли;                                   

	Если НЕ МассивUserId = Неопределено И НЕ ТипЗнч(МассивUserId) = Тип("Массив") Тогда
		UserId = МассивUserId;
		МассивUserId = Новый Массив;
		МассивUserId.Добавить(UserId);
	КонецЕсли;                                   

	Если НЕ РегистрыСведений.дкл_ПользователиСкладов.РеквизитыЗаполненыПередОтправкойВАСХ(НастройкаСклада, МассивПользователей, МассивUserId) Тогда
		Возврат;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Обработка.ВыгрузитьПользователейСклада(НастройкаСклада, МассивПользователей, МассивUserId);
	
КонецПроцедуры

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура ВыгрузитьСкладскиеЯчейки(НастройкаСклада, СкладскиеЯчейки) Экспорт

	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Обработка.ВыгрузитьСкладскиеЯчейки(НастройкаСклада, СкладскиеЯчейки);
	
КонецПроцедуры

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
Процедура УдалитьСкладскиеЯчейки(НастройкаСклада, СкладскиеЯчейки) Экспорт

	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Обработка.УдалитьСкладскиеЯчейки(НастройкаСклада, СкладскиеЯчейки);
	
КонецПроцедуры

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьОстатки(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ПолучитьОстатки(НастройкаСклада);
	
КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСписокНоменклатуры(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Интерфейс = "ItemService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);
	
	//@skip-check bsl-variable-name-invalid
	request = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetItemList"));	       
	
	Ответ = Прокси.getItemList(request);
	
	Возврат ОбъектXDTOВСтруктуру(Ответ);
	
КонецФункции // ()          
 
//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСписокПользователей(НастройкаСклада) Экспорт 

	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);

	Возврат Обработка.ПолучитьСписокПользователей(НастройкаСклада);

	УстановитьПривилегированныйРежим(Истина);

	Интерфейс = "UserService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);

	Если мФабрикаXDTO = Неопределено Тогда
		Возврат Новый Структура; 	
	КонецЕсли;
	
	//@skip-check bsl-variable-name-invalid
	request = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetUserList"));	       
		
	Попытка
		Ответ = Прокси.getUserList(request);
	Исключение                                 
		Ошибка  = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		Текст = СтрШаблон(
		"%1 
		|(%2)", 
		Ошибка, "в АСХ должны быть заполнены все обязательные реквизиты пользователей");
		ОбщегоНазначения.СообщитьПользователю(Текст);
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ОбъектXDTOВСтруктуру(Ответ);

КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьСписокОшибокЛифта(НастройкаСклада) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Интерфейс = "DVSStatusService";	
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	
	//@skip-check bsl-variable-name-invalid
	мФабрикаXDTO = ПолучитьФабрикуХДТОПоПрокси(Прокси);
	
	//@skip-check bsl-variable-name-invalid
	request = мФабрикаXDTO.Создать(
		мФабрикаXDTO.Тип(дкл_ОбщегоНазначенияСервер.URIПространстваИменСервиса(), "GetErrorLogList"));	       
	
	Ответ = Прокси.getErrorLogList(request);
	
	Возврат ОбъектXDTOВСтруктуру(Ответ);
	
КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция ВыдатьПолку(НастройкаСклада, НомерПолки, requestId = Неопределено, feederId = 1) Экспорт 

	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ВыдатьПолку(НастройкаСклада, НомерПолки, requestId, feederId);
	
КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция ВернутьПолку(НастройкаСклада, НомерПолки, requestId = Неопределено) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ВернутьПолку(НастройкаСклада, НомерПолки, requestId);
	
КонецФункции // ()          

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция СостояниеЗапроса(НастройкаСклада, requestId = Неопределено) Экспорт 
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.СостояниеЗапроса(НастройкаСклада, requestId); 

КонецФункции // ()  

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция ОбновитьПолкуВЛифте(НастройкаСклада, РеквизитыПолки) Экспорт
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ОбновитьПолкуВЛифте(НастройкаСклада, РеквизитыПолки);
	
КонецФункции // ()

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция РедактированиеПолкиВЛифте(НастройкаСклада, РеквизитыПолки) Экспорт
	
	Если НЕ Справочники.дкл_НастройкиСкладовЛифтов.ПроверитьСтрокуСоединения(НастройкаСклада, Истина) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.РедактированиеПолкиВЛифте(НастройкаСклада, РеквизитыПолки);
	
КонецФункции // ()

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
//@skip-check bsl-variable-name-invalid
Функция ПолучитьСтатусСклада(НастройкаСклада) Экспорт
	
	Обработка = ПодключитьОбработкуExternalIntegration(НастройкаСклада);
	Возврат Обработка.ПолучитьСтатусСклада(НастройкаСклада);

КонецФункции // ()

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодключитьОбработкуExternalIntegration(НастройкаСклада) Экспорт

	УстановитьПривилегированныйРежим(Истина);    
	
	// ВерсияПО = Справочники.дкл_НастройкиСкладовЛифтов.ВерсияПО(НастройкаСклада);
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастройкаСклада, "ВерсияПО, СпособПодключения");
	
	ВерсияПО = ЗначенияРеквизитов.ВерсияПО;              
	
	СпособПодключения = Лев(Строка(ЗначенияРеквизитов.СпособПодключения),4);
	
	Если ВерсияПО = "1.6" Тогда	  

		Обработка = РегистрыСведений.дкл_Обработки.ПодключитьОбработку(
			Перечисления.дкл_ТипыСообщений.ExternalIntegration_v16, 
				Перечисления.дкл_НаправлениеСообщения.Исходящее, СпособПодключения);

		Если Обработка = Неопределено Тогда
			Обработка = Обработки["ExternalIntegration_v16"];
		КонецЕсли;
			
	ИначеЕсли Лев(ВерсияПО, 2) = "2." И СпособПодключения = "HTTP" Тогда

		Обработка = РегистрыСведений.дкл_Обработки.ПодключитьОбработку(
			Перечисления.дкл_ТипыСообщений.ExternalIntegration_v21_HTTP, 
				Перечисления.дкл_НаправлениеСообщения.Исходящее);

		Если Обработка = Неопределено Тогда
			Обработка = Обработки["ExternalIntegration_v21_HTTP"];
		КонецЕсли;

	ИначеЕсли Лев(ВерсияПО, 2) = "2." И НЕ СпособПодключения = "HTTP" Тогда

		Обработка = РегистрыСведений.дкл_Обработки.ПодключитьОбработку(
			Перечисления.дкл_ТипыСообщений.ExternalIntegration_v21, 
				Перечисления.дкл_НаправлениеСообщения.Исходящее);

		Если Обработка = Неопределено Тогда
			Обработка = Обработки["ExternalIntegration_v21"];
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат Обработка;

КонецФункции // ()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнициализироватьДанныеСообщенияОбмена() Экспорт

	//@skip-check structure-consructor-too-many-keys
	ДанныеСообщенияОбмена = 
		Новый Структура(
			"IDСообщения, Дата, ТипСообщения, Направление, 
			|Месяц, Сообщение, ХранилищеЗначения, Автор, ДатаОбработки,
			|НавигационнаяСсылка,НастройкаСклада,Обработано,
			|Ответ,СообщениеОбОшибке,СсылкаНаОбъект,Статус");

	Возврат ДанныеСообщенияОбмена;
	
КонецФункции

Функция ПолучитьФабрикуХДТОПоПрокси(Прокси) Экспорт     
	Попытка
		Возврат Прокси.ФабрикаXDTO;
	Исключение
		Возврат Неопределено;	
	КонецПопытки;
	
КонецФункции

Функция ПолучитьФабрикуХДТОПоНастройкеСклада(Интерфейс, НастройкаСклада) Экспорт   
	Прокси = дкл_ОбщегоНазначенияСервер.СоздатьПрокси(Интерфейс, НастройкаСклада);
	Возврат Прокси.ФабрикаXDTO;
КонецФункции

// Преобразует объект XDTO в структуру
//
// Параметры:
//  ОбъектXDTO - ОбъектXDTO - Объект XDTO
//  ПараметрыПреобразования - Неопределено, Структура - дополнительные переметры преобразования объекта
// 
// Возвращаемое значение:
//  Структура - Структура объекта.
//
Функция ОбъектXDTOВСтруктуру(ОбъектXDTO, ПараметрыПреобразования = Неопределено) Экспорт
	
	Структура      = Новый Структура;
	ТипОбъектаXDTO = ОбъектXDTO.Тип();
	
	Для Каждого Свойство Из ОбъектXDTO.Свойства() Цикл
		
		ИмяСвойства      = Свойство.Имя;
		ЗначениеСвойства = ОбъектXDTO[ИмяСвойства];
		
		Если ТипЗнч(ЗначениеСвойства) = Тип("ОбъектXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, ОбъектXDTOВСтруктуру(ЗначениеСвойства, ПараметрыПреобразования));
			
		ИначеЕсли ТипЗнч(ЗначениеСвойства) = Тип("СписокXDTO") Тогда
			
			Структура.Вставить(ИмяСвойства, Новый Массив);
			Для Индекс = 0 По ЗначениеСвойства.Количество() - 1 Цикл
				
				ЭлементСписка = ЗначениеСвойства.Получить(Индекс);
				Если ТипЗнч(ЭлементСписка) = Тип("ОбъектXDTO") Тогда
					Структура[ИмяСвойства].Добавить(ОбъектXDTOВСтруктуру(ЭлементСписка, ПараметрыПреобразования));
				Иначе
					Структура[ИмяСвойства].Добавить(ЭлементСписка);
				КонецЕсли;
				
			КонецЦикла;
			
		Иначе
			
			Структура.Вставить(ИмяСвойства, ЗначениеСвойства);
			
			Если ПараметрыПреобразования <> Неопределено
				И ПараметрыПреобразования.НайтиИдентификаторы
				И Свойство.Тип = ПараметрыПреобразования.ТипUUID Тогда
				
				РезультатПоиска = ПараметрыПреобразования.ТипыИдентификаторов[ТипОбъектаXDTO];
				Если РезультатПоиска <> Неопределено
					И РезультатПоиска.ИмяПоля = ИмяСвойства Тогда
					ПараметрыПреобразования.Идентификаторы[РезультатПоиска.ИмяТаблицы].Вставить(ЗначениеСвойства, РезультатПоиска.ПустоеЗначение);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти
